<script setup lang="ts">
const title = ref('Лечение в Турции в 2024 году. Бесплатная консультация!')
const description = ref(
    'Подберём лучшую клинику в Турции по вашим критериям. Пересадка волос FUE, DHI, лечение зубов, пластические операции, нейрохирургия. Клиники в Стамбул, Измир, Анталья.'
)

useHead({
    title,
    meta: [
        {
            name: 'description',
            content:
                'Подберём лучшую клинику в Турции по вашим критериям. Пересадка волос FUE, DHI, лечение зубов, пластические операции, нейрохирургия. Клиники в Стамбул, Измир, Анталья.',
        },
        { property: 'og:title', content: 'Лечение в Турции в 2024 году' },
        {
            property: 'og:description',
            content:
                'Подберём лучшую клинику в Турции по вашим критериям. Пересадка волос FUE, DHI, лечение зубов, пластические операции, нейрохирургия. Клиники в Стамбул, Измир, Анталья.',
        },
        { property: 'og:image', content: '/image-meta.png' },
        { property: 'og:site_name', content: 'Лечение в Турции в 2024 году.' },
    ],
})
</script>

<template>
    <NuxtPage />
</template>
