<script setup>
import { ref } from 'vue'
const questionsHair = ref([
    {
        id: 1,
        title: 'Что такое нейротерапия?',

        info: {
            description:
                'Нейротерапия — это метод лечения, который направлен на восстановление нормальной работы нервной системы и улучшение обменных процессов в организме с помощью воздействия на нервные окончания и ткани.',
        },
        expanded: false,
    },
    {
        id: 2,
        title: 'Почему нейротерапия лучше скальпеля?',
        info: {
            description:
                'Нейротерапия эффективно применяется при лечении заболеваний позвоночника, таких как межпозвоночные грыжи и остеохондроз. Этот метод позволяет воздействовать на проблему, не прибегая к хирургическому вмешательству, что делает его безопасным и малотравматичным.',
        },
        expanded: false,
    },

    {
        id: 3,
        title: 'Кому подойдёт метод нейротерапии?',
        info: {
            titlePoints: 'Метод подойдёт для ВСЕХ, в особенности:',
            points: [
                'Пожилых людей, для которых операция может быть рискованной.',
                'Спортсменов - нейротерапия способствует быстрому восстановлению после травм и перегрузок.',
                'Людей с межпозвоночными грыжами, остеохондрозом и хроническими болями в спине, которым не показаны операции.',
                'Тех, кто страдает от болевого синдрома, вызванного воспалениями или нарушениями нервной системы.',
            ],
        },
        expanded: false,
    },
])
</script>
<template>
    <Modal />
    <div class="section-1">
        <TitleSection>Лечение грыжи без скальпеля в Турции</TitleSection>
        <div class="mt-20">
            <p class="services__text">
                Нейротерапия — безопасный и малотравматичный метод лечения грыж
                и позвоночника, особенно важный для пожилых людей и спортсменов.
                Мы поможем вернуть свободу движения без операций.
            </p>
        </div>
        <div class="mt-40">
            <FormServices backgroundImage="/p-22.jpeg" />
        </div>
    </div>
    <div class="section-2">
        <TitleSection>Этапы лечения</TitleSection>

        <div class="mt-20">
            <p class="services__text">
                Метод нейротерапии — инновационный подход, направленный на
                восстановление позвоночника и устранение грыж без операций.
                Процесс включает диагностику, индивидуальный план лечения и
                поэтапное восстановление под наблюдением опытных специалистов.
                Все этапы безопасны и комфортны.
            </p>
        </div>

        <div class="stages__wrapper">
            <StagesCard
                title="Бесплатная"
                title2="Консультация"
                desc="Поможем выбрать лучшую клинику и врача, направляя запросы к узкопрофильным специалистам."
                color="#4245D7"
            />
            <StagesCard
                title="Связываемся c"
                title2="специалистами"
                desc="Предлагаем лучшие варианты, учитывая цены, квалификацию специалистов и ваши предпочтения."
                color="#67CFB8"
            />
            <StagesCard
                title="Организуем"
                title2="Перелёт"
                desc="После определения клиник, договариваемся о всех  моментах. От перелёта до трансфера в отель у аэропорта."
                color="#429FD7"
            />
            <StagesCard
                title="Поддержка"
                title2="24/7"
                desc="Сопровождаем на всех этапах лечения. На связи 24/7 - поможем с любыми вопросами и трудностями."
                color="#D742BC"
            />
        </div>

        <div class="mt-40">
            <p class="services__text">
                Мы найдем для вас качественный отель с удобным расположением,
                организуем трансфер из аэропорта, в клинику и обратно. Наши
                специалисты будут рядом на каждом этапе, чтобы ваша поездка была
                максимально комфортной и результативной.
            </p>
        </div>
        <div class="hair__about__cards">
            <AboutCards
                title="Полный цикл сопровождения"
                desc="Мы берем на себя все: от первой консультации и проведения анализов до успешной операции и вашего комфортного возвращения домой."
            />
            <AboutCards
                title="Прозрачность и уверенность"
                desc="Мы не берем предоплат. Оплата производится только после выполненной операции и вашего уверенного решения."
            />
            <AboutCards
                title="24/7 Помощь и гарантия"
                desc="Мы будем с вами от первого звонка до завершения процедуры, чтобы вы чувствовали себя комфортно и безопасно."
            />
            <AboutCards
                title="Индивидуальный подход для каждого"
                desc="Поможем подобрать клинику и финансовый вариант, который будет оптимален именно для вас."
            />
            <AboutCards
                title="Открытость во всем"
                desc="Мы заранее информируем о каждой детали: от хода процедуры до всех расходов, чтобы исключить любые сюрпризы."
            />
        </div>
    </div>

    <div class="section-3">
        <TitleSection>Популярные вопросы</TitleSection>
        <div class="question__wrapper">
            <Question
                v-for="question in questionsHair"
                :key="question.id"
                :title="question.title"
                :info="question.info"
            />
        </div>
    </div>

    <div class="section-3">
        <Contacts />
    </div>
</template>
