<script setup>
import { ref } from 'vue'
const questions = ref([
    {
        id: 1,
        title: 'Почему выбирают лечиться в Турции?',
        info: 'Лечение в Турции привлекает высоким качеством медицинских услуг и доступными ценами. Здесь вы найдете широкий спектр процедур, комфортные условия и русскоязычный персонал. А также сможете совместить лечение и отдых на красивых курортах.',
    },
    {
        id: 2,
        title: 'Сколько стоит лечение в Турции?',
        info: 'Стоимость медицинских услуг в Турции очень индивидуальна и зависит от конкретной процедуры, клиники и дополнительных услуг. Чтобы получить точную информацию о ценах, вы можете записаться на бесплатную консультацию.',
    },
    {
        id: 3,
        title: 'Какие документы нужны для лечения?',
        info: 'Для получения медицинских услуг в Турции вам понадобится только загранпаспорт. Дополнительные документы могут потребоваться на этапе консультации.',
    },
    {
        id: 4,
        title: 'Сколько времени занимает реабилитация после операций?',
        info: 'Время восстановления после операции варьируется в зависимости от процедуры и индивидуальных факторов. Обычно реабилитация занимает от 1 до 4 недель. Примерные сроки реабилитации вы можете узнать на бесплатной консультации с врачом и консультантом.',
    }
])
</script>
<template>
    <div class="faq" id="faq">
        <TitleSection>Популярные вопросы</TitleSection>
        <div class="faq__wrapper">
            <FAQCard
            v-for="question in questions"
            :key="question.id"
            :title="question.title"
            :info="question.info" />
        </div>
    </div>
</template>

<style lang="scss" scoped>
.faq {
   &__wrapper {
    display: flex;
    flex-direction: column;
    margin-top: 20px;
   }
}
</style>